frontend/controllers/ArticleController.php

SELECT * FROM `dsn_article` WHERE (`id`='3') AND (`type`=0) AND (`status`=1)
UPDATE `dsn_article` SET `scan_count`=`scan_count`+1 WHERE `id`='3'
---
    public function behaviors()
    {
        return [
            [
                'class' =>VerbFilter::className(),
                'actions' => [
                    'comment'  => ['POST'],
                ]
            ],
            [
                'class' => HttpCache::className(),
                'only' => ['view'],
                'lastModified' => function ($action, $params) {
                    $id = Yii::$app->getRequest()->get('id');
                    $model = Article::findOne(['id' => $id, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED]);
                    if( $model === null ) throw new NotFoundHttpException(Yii::t("frontend", "Article id {id} is not exists", ['id' => $id]));
                    Article::updateAllCounters(['scan_count' => 1], ['id' => $id]);

SELECT * FROM `dsn_article` WHERE ((`cid`=0) AND (`type`=0) AND (`status`=1)) AND (`id` > '3') ORDER BY `sort`, `id` LIMIT 1
SELECT * FROM `dsn_article` WHERE ((`cid`=0) AND (`type`=0) AND (`status`=1)) AND (`id` < '3') ORDER BY `sort`, `id` DESC LIMIT 1
SELECT * FROM `dsn_article` WHERE ((`type`=0) AND (`status`=1)) AND (`thumb` <> '') ORDER BY `scan_count` LIMIT 8
---
    public function actionView($id)
    {
        /** @var ArticleServiceInterface $articleService */
        $articleService = Yii::$app->get(ArticleServiceInterface::ServiceName);
        $model = $articleService->getArticleById($id);
        /** @var Article $model */
        if( $model === null ) throw new NotFoundHttpException(Yii::t("frontend", "Article id {id} is not exists", ['id' => $id]));
        $prev = Article::find()
            ->where(['cid' => $model->cid, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['>', 'id', $id])
            ->orderBy("sort asc,id asc")
            ->limit(1)
            ->one();
        $next = Article::find()
            ->where(['cid' => $model->cid, 'type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['<', 'id', $id])
            ->orderBy("sort asc,id desc")
            ->limit(1)
            ->one();//->createCommand()->getRawSql();
        $commentModel = new Comment();
        $commentList = $commentModel->getCommentByAid($id);
        $recommends = Article::find()
            ->where(['type' => Article::ARTICLE, 'status' => Article::ARTICLE_PUBLISHED])
            ->andWhere(['<>', 'thumb', ''])
            ->orderBy("scan_count")
            ->limit(8)
            ->with('category')
            ->all();