common/services/TeamService.php

SELECT * FROM `dsn_team` WHERE `id`='15'
---
    public function getModel($id, array $options = [])
    {
        $model = Team::findOne($id);