frontend/widgets/MenuView.php

    public function run()
    {
        parent::run();
        static $menus = null;
        if( $menus === null ) {
            $menus = Menu::find()
                ->where(['type' => Menu::TYPE_FRONTEND, 'is_display' => Menu::DISPLAY_YES])
                ->orderBy("sort asc,parent_id asc")
                ->all();
---
SELECT * FROM `dsn_menu` WHERE (`type`=1) AND (`is_display`=1) ORDER BY `sort`, `parent_id`